---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalLinkReleaseRotationY
source: html/ee42e0aa-e8df-6728-6d05-f709a4c490e2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalLinkReleaseRotationY Property

"Y Rotation"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalLinkReleaseRotationY { get; }
```